; domain
(define (domain citycar)
(:requirements :typing :equality :negative-preconditions :action-costs :conditional-effects)
  (:types
	car
	junction
	garage
	road
	)

  (:predicates
    (same_line ?xy - junction ?xy2 - junction) ;; junctions in line (row)
    (diagonal ?x - junction ?y - junction ) ;; junctions in diagonal (on the map)
    (at_car_jun ?c - car ?x - junction) ;; a car is at the junction
    (at_car_road ?c - car ?x - road) ;; a car is in a road
    (starting ?c - car ?x - garage) ;; a car is in its initial position
    (arrived ?c - car ?x - junction) ;; a car arrived at destination
    (road_connect ?r1 - road ?xy - junction ?xy2 - junction) ;; there is a road that connects 2 junctions
    (clear ?xy - junction ) ;; the junction is clear
    (in_place ?x - road);; the road has been put in place
    (at_garage ?g - garage ?xy - junction ) ;; position of the starting garage

  )
(:functions (total-cost) - number)

;; move the car in a road: no limit on the number of cars on the road
(:action move_car_in_road
  :parameters (?xy_initial - junction ?xy_final - junction ?machine - car ?r1 - road)
  :precondition (and
		(at_car_jun ?machine ?xy_initial)
		(not (= ?xy_initial ?xy_final))
		(road_connect ?r1 ?xy_initial ?xy_final)
		(in_place ?r1)
		)
  :effect (and
		(clear ?xy_initial)
		(at_car_road ?machine ?r1)
		(not (at_car_jun ?machine ?xy_initial) )
		(increase (total-cost) 1)
		)
)

;; move the car out of the road to a junction. Junction must be clear.
(:action move_car_out_road
  :parameters (?xy_initial - junction ?xy_final - junction ?machine - car ?r1 - road)
  :precondition (and
		(at_car_road ?machine ?r1)
		(clear ?xy_final)
		(not (= ?xy_initial ?xy_final))
		(road_connect ?r1 ?xy_initial ?xy_final)
		(in_place ?r1)
		)
  :effect (and
		(at_car_jun ?machine ?xy_final)
		(not (clear ?xy_final))
		(not (at_car_road ?machine ?r1) )
		(increase (total-cost) 1)
		)
)

;; car in the final position. They are removed from the network and position is cleared.
(:action car_arrived
  :parameters (?xy_final - junction ?machine - car )
  :precondition (and
		(at_car_jun ?machine ?xy_final)
		)
  :effect (and
		(clear ?xy_final)
		(arrived ?machine ?xy_final)
		(not (at_car_jun ?machine ?xy_final))
		)
)

;; car moved from the initial garage in the network.
(:action car_start
  :parameters (?xy_final - junction ?machine - car ?g - garage)
  :precondition (and
		(at_garage ?g ?xy_final)
		(starting ?machine ?g)
		(clear ?xy_final)
		)
  :effect (and
		(not (clear ?xy_final))
		(at_car_jun ?machine ?xy_final)
		(not (starting ?machine ?g))
		)
)

;; build diagonal road
(:action build_diagonal_oneway
  :parameters (?xy_initial - junction ?xy_final - junction ?r1 - road)
  :precondition (and
		(clear ?xy_final)
		(not (= ?xy_initial ?xy_final))
		(not (in_place ?r1))
		(diagonal ?xy_initial ?xy_final)
		)
  :effect (and
		(road_connect ?r1 ?xy_initial ?xy_final)
		(in_place ?r1)
                (increase (total-cost) 30)
		)
)

;; build straight road
(:action build_straight_oneway
  :parameters (?xy_initial - junction ?xy_final - junction ?r1 - road)
  :precondition (and
		(clear ?xy_final)
		(not (= ?xy_initial ?xy_final))
		(same_line ?xy_initial ?xy_final)
		(not (in_place ?r1))
		)
  :effect (and
		(road_connect ?r1 ?xy_initial ?xy_final)
		(in_place ?r1)
                (increase (total-cost) 20)
		)
)

;; remove a road
(:action destroy_road
  :parameters (?xy_initial - junction ?xy_final - junction ?r1 - road)
  :precondition (and
		(road_connect ?r1 ?xy_initial ?xy_final)
		(not (= ?xy_initial ?xy_final))
		(in_place ?r1)
		)
  :effect (and
		(not (in_place ?r1))
		(not (road_connect ?r1 ?xy_initial ?xy_final))
                (increase (total-cost) 10)
		(forall (?c1 - car)
                     (when (at_car_road ?c1 ?r1)
			(and
			  (not (at_car_road ?c1 ?r1))
			  (at_car_jun ?c1 ?xy_initial)
			)
		      )
		   )
		)
)




)

; problem
(define (problem citycar-3-3-2)
(:domain citycar)
(:objects
junction0-0 junction0-1 junction0-2
junction1-0 junction1-1 junction1-2
junction2-0 junction2-1 junction2-2 - junction
car0 car1 - car
garage0 garage1 garage2 - garage
road0 road1 road2 road3 road4 - road
)
(:init
(same_line junction0-0 junction0-1)
(same_line junction0-1 junction0-0)
(same_line junction0-1 junction0-2)
(same_line junction0-2 junction0-1)
(same_line junction1-0 junction1-1)
(same_line junction1-1 junction1-0)
(same_line junction1-1 junction1-2)
(same_line junction1-2 junction1-1)
(same_line junction2-0 junction2-1)
(same_line junction2-1 junction2-0)
(same_line junction2-1 junction2-2)
(same_line junction2-2 junction2-1)
(same_line junction0-0 junction1-0)
(same_line junction1-0 junction0-0)
(same_line junction1-0 junction2-0)
(same_line junction2-0 junction1-0)
(same_line junction0-1 junction1-1)
(same_line junction1-1 junction0-1)
(same_line junction1-1 junction2-1)
(same_line junction2-1 junction1-1)
(same_line junction0-2 junction1-2)
(same_line junction1-2 junction0-2)
(same_line junction1-2 junction2-2)
(same_line junction2-2 junction1-2)
(diagonal junction0-0 junction1-1)
(diagonal junction1-1 junction0-0)
(diagonal junction0-1 junction1-0)
(diagonal junction1-0 junction0-1)
(diagonal junction0-1 junction1-2)
(diagonal junction1-2 junction0-1)
(diagonal junction0-2 junction1-1)
(diagonal junction1-1 junction0-2)
(diagonal junction1-0 junction2-1)
(diagonal junction2-1 junction1-0)
(diagonal junction1-1 junction2-0)
(diagonal junction2-0 junction1-1)
(diagonal junction1-1 junction2-2)
(diagonal junction2-2 junction1-1)
(diagonal junction1-2 junction2-1)
(diagonal junction2-1 junction1-2)
(clear junction0-0)
(clear junction0-1)
(clear junction0-2)
(clear junction1-0)
(clear junction1-1)
(clear junction1-2)
(clear junction2-0)
(clear junction2-1)
(clear junction2-2)
(at_garage garage0 junction0-0)
(at_garage garage1 junction0-1)
(at_garage garage2 junction0-0)
(starting car0 garage0)
(starting car1 garage1)
(= (total-cost) 0)
)
(:goal
(and
(arrived car0 junction2-0)
(arrived car1 junction2-0)
)
)
(:metric minimize (total-cost))
)

; plan
1. (build_straight_oneway junction2-0 junction1-0 road4)
   added: (road_connect road4 junction2-0 junction1-0) (in_place road4)
   goals met: 0 of 2
2. (car_start junction0-0 car0 garage0)
   deleted: (clear junction0-0) (starting car0 garage0)
   added: (at_car_jun car0 junction0-0)
   goals met: 0 of 2
3. (car_start junction0-1 car1 garage1)
   deleted: (clear junction0-1) (starting car1 garage1)
   added: (at_car_jun car1 junction0-1)
   goals met: 0 of 2
4. (destroy_road junction2-0 junction1-0 road4)
   deleted: (in_place road4) (road_connect road4 junction2-0 junction1-0)
   goals met: 0 of 2
5. (build_straight_oneway junction0-0 junction1-0 road0)
   added: (road_connect road0 junction0-0 junction1-0) (in_place road0)
   goals met: 0 of 2
6. (build_straight_oneway junction1-0 junction2-0 road4)
   added: (road_connect road4 junction1-0 junction2-0) (in_place road4)
   goals met: 0 of 2
7. (move_car_in_road junction0-0 junction1-0 car0 road0)
   deleted: (at_car_jun car0 junction0-0)
   added: (clear junction0-0) (at_car_road car0 road0)
   goals met: 0 of 2
8. (move_car_out_road junction0-0 junction1-0 car0 road0)
   deleted: (clear junction1-0) (at_car_road car0 road0)
   added: (at_car_jun car0 junction1-0)
   goals met: 0 of 2
9. (move_car_in_road junction1-0 junction2-0 car0 road4)
   deleted: (at_car_jun car0 junction1-0)
   added: (clear junction1-0) (at_car_road car0 road4)
   goals met: 0 of 2
10. (move_car_out_road junction1-0 junction2-0 car0 road4)
   deleted: (clear junction2-0) (at_car_road car0 road4)
   added: (at_car_jun car0 junction2-0)
   goals met: 0 of 2
11. (car_arrived junction2-0 car0)
   deleted: (at_car_jun car0 junction2-0)
   added: (clear junction2-0) (arrived car0 junction2-0)
   goals met: 1 of 2
12. (build_diagonal_oneway junction0-1 junction1-0 road3)
   added: (road_connect road3 junction0-1 junction1-0) (in_place road3)
   goals met: 1 of 2
13. (move_car_in_road junction0-1 junction1-0 car1 road3)
   deleted: (at_car_jun car1 junction0-1)
   added: (clear junction0-1) (at_car_road car1 road3)
   goals met: 1 of 2
14. (move_car_out_road junction0-1 junction1-0 car1 road3)
   deleted: (clear junction1-0) (at_car_road car1 road3)
   added: (at_car_jun car1 junction1-0)
   goals met: 1 of 2
15. (move_car_in_road junction1-0 junction2-0 car1 road4)
   deleted: (at_car_jun car1 junction1-0)
   added: (clear junction1-0) (at_car_road car1 road4)
   goals met: 1 of 2
16. (move_car_out_road junction1-0 junction2-0 car1 road4)
   deleted: (clear junction2-0) (at_car_road car1 road4)
   added: (at_car_jun car1 junction2-0)
   goals met: 1 of 2
17. (car_arrived junction2-0 car1)
   deleted: (at_car_jun car1 junction2-0)
   added: (clear junction2-0) (arrived car1 junction2-0)
   goals met: 2 of 2
